문자열로 된 계산식이 주어질 때, 스택을 이용하여 이 계산식의 값을 계산할 수

문자열 수식 계산의 일반적 방법
* step1. 중위 표기법의 수식을 후위 표기법으로 변경한다. (스택 이용)
* step2. 후위 표기법의 수식을 스택을 이용하여 계산한다

- 중위 표기법: 일반적으로 사용되는 표기법. 연산자를 피연산자의 가운데 표기하는 방법 ex) A + B
- 후위 표기법: 연산자를 피연산자 뒤에 표기하는 방법 ex) AB+

step1) 중위 표기식의 후위 표기식 변환 방법1
* 수식의 각 연산자에 대해서 우선순위에 따라 괄호를 사용하여 다시 표현한다
* 각 연산자를 그에 대응하는 오른쪽 괄호의 뒤로 이동한다
* 괄호를 제거한다
ex) A*B-C/D
1단계 : ((A*B)-(C/D))
2단계 : ((AB*)-(CD/))
3단계 : AB*CD/-

step1) 중위 표기식의 후위 표기식 변환 방법2 (스택 이용)
1) 입력받은 중위 표기식에서 토큰을 읽는다
2) 토큰이 피연산자이면 토큰을 출력한다
3) 토큰이 연산자(괄호포함)일 때, 다음의 과정을 반복한다